------------------------------------------------------------
Русский перевод LICENSE
------------------------------------------------------------

Лицензия MIT

Copyright (c) 2025-2026 Alexey Ezerskiy (Алексей Езерский).

Настоящим бесплатно предоставляется разрешение любому лицу, получившему
копию данного программного обеспечения и связанных с ним файлов документации
(далее — «Программное обеспечение»), использовать Программное обеспечение
без ограничений, включая, помимо прочего, права на использование,
копирование, изменение, объединение, публикацию, распространение,
сублицензирование и/или продажу копий Программного обеспечения, а также
разрешение лицам, которым предоставляется Программное обеспечение, делать
то же самое при соблюдении следующих условий:

Указанное выше уведомление об авторских правах и настоящее уведомление
о разрешении должны быть включены во все копии или существенные части
Программного обеспечения.

ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО
ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ГАРАНТИИ
ТОВАРНОЙ ПРИГОДНОСТИ, ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ И НЕНАРУШЕНИЯ
ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ
ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО ИСКАМ, УБЫТКАМ ИЛИ ИНЫМ ОБЯЗАТЕЛЬСТВАМ,
ВОЗНИКШИМ В РЕЗУЛЬТАТЕ ДОГОВОРА, ДЕЛИКТА ИЛИ ИНОГО ОСНОВАНИЯ, В СВЯЗИ
С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ, ЕГО ИСПОЛЬЗОВАНИЕМ ИЛИ ИНЫМИ ДЕЙСТВИЯМИ
С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
